# customer-api - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/production-customer-api]
module.common_resources.module.kafka_topic_credential.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=dmywjyormj]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-customer-api-production]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=production-cockroachdb-serverless-cluster-id]
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=2539ad74-c3bc-4b10-bb6e-e55edf9e9fbf:production-customer-api]
module.common_resources.module.kafka_topic_credential.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=production-kafka-cluster-id]
module.common_resources.module.kafka_topic_credential.upstash_kafka_credential.default: Refreshing state... [id=upstash-kafka-credential-a440b083-4d79-4a4f-8dcd-a353e6821f68]
module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-customer-api-production-20230427100649546400000001]
module.common_resources.module.aws_api_gateway.aws_ssm_parameter.default: Refreshing state... [id=production_customer_api_endpoint]
module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/production_customer_api]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.common_resources.module.aws_lambda.data.archive_file.default: Read complete after 2s [id=9f8185544c5882212e48a2b70c764b996761e096]
module.common_resources.module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=production-customer-api]
module.common_resources.module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=ot9pxvi]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_route.any: Refreshing state... [id=smazsvg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_api_gateway.aws_apigatewayv2_integration.default will be updated in-place
  ~ resource "aws_apigatewayv2_integration" "default" {
        id                     = "ot9pxvi"
      ~ integration_uri        = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:514472330244:function:production-customer-api/invocations" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.common_resources.module.aws_api_gateway.aws_lambda_permission.default must be replaced
-/+ resource "aws_lambda_permission" "default" {
      ~ function_name       = "production-customer-api" -> "production_customer_api" # forces replacement
      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default must be replaced
-/+ resource "aws_cloudwatch_log_group" "default" {
      ~ arn               = "arn:aws:logs:us-east-1:514472330244:log-group:/aws/lambda/production-customer-api" -> (known after apply)
      ~ id                = "/aws/lambda/production-customer-api" -> (known after apply)
      ~ name              = "/aws/lambda/production-customer-api" -> "/aws/lambda/production_customer_api" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "domain"        = "customer"
            "environment"   = "production"
            "resource"      = "customer-api"
            "resource_type" = "lambda"
        }
        # (3 unchanged attributes hidden)
    }

  # module.common_resources.module.aws_lambda.aws_iam_role.default must be replaced
-/+ resource "aws_iam_role" "default" {
      ~ arn                   = "arn:aws:iam::514472330244:role/lambda-execution-customer-api-production" -> (known after apply)
      ~ create_date           = "2023-04-27T10:06:49Z" -> (known after apply)
      ~ id                    = "lambda-execution-customer-api-production" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> (known after apply)
      ~ name                  = "lambda-execution-customer-api-production" -> "lambda-execution-production_customer_api" # forces replacement
      + name_prefix           = (known after apply)
      ~ role_last_used        = [
          - {
              - last_used_date = "2023-04-28T02:34:38Z"
              - region         = "us-east-1"
            },
        ] -> (known after apply)
        tags                  = {
            "domain"        = "customer"
            "environment"   = "production"
            "resource"      = "customer-api"
            "resource_type" = "lambda"
        }
      ~ unique_id             = "AROAXPSHQYQCAM2C3SKDU" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default must be replaced
-/+ resource "aws_iam_role_policy_attachment" "default" {
      ~ id         = "lambda-execution-customer-api-production-20230427100649546400000001" -> (known after apply)
      ~ role       = "lambda-execution-customer-api-production" -> "lambda-execution-production_customer_api" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.aws_lambda.aws_lambda_function.default must be replaced
-/+ resource "aws_lambda_function" "default" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-1:514472330244:function:production-customer-api" -> (known after apply)
      ~ function_name                  = "production-customer-api" -> "production_customer_api" # forces replacement
      ~ id                             = "production-customer-api" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:514472330244:function:production-customer-api/invocations" -> (known after apply)
      ~ last_modified                  = "2023-04-28T05:00:01.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:514472330244:function:production-customer-api:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:514472330244:function:production-customer-api:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::514472330244:role/lambda-execution-customer-api-production" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_size               = 18749295 -> (known after apply)
        tags                           = {
            "domain"        = "customer"
            "environment"   = "production"
            "resource"      = "customer-api"
            "resource_type" = "lambda"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (11 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING" = (sensitive value)
            } -> (known after apply)
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "production-customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "production-customer_api"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default must be replaced
-/+ resource "cockroach_sql_user" "default" {
      ~ id         = "2539ad74-c3bc-4b10-bb6e-e55edf9e9fbf:production-customer-api" -> (known after apply)
      ~ name       = "production-customer-api" -> "production-customer_api" # forces replacement
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "135f5163-ae9c-457d-b4de-aa936dd2e3fb" -> "0c1dc207-0e75-4822-856b-678a1b027479"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

  # module.common_resources.module.kafka_topic_credential.upstash_kafka_credential.default must be replaced
-/+ resource "upstash_kafka_credential" "default" {
      ~ creation_time   = 1682597127 -> (known after apply)
      ~ credential_id   = "a440b083-4d79-4a4f-8dcd-a353e6821f68" -> (known after apply)
      ~ credential_name = "customer-api" -> "production_customer_api" # forces replacement
      ~ id              = "upstash-kafka-credential-a440b083-4d79-4a4f-8dcd-a353e6821f68" -> (known after apply)
      ~ password        = (sensitive value)
      ~ permissions     = "ALL" -> "PRODUCE" # forces replacement
      ~ state           = "active" -> (known after apply)
      ~ topic           = "customer.v1" -> "production.customer.v1" # forces replacement
      ~ username        = "Zml0LWJ1ZmZhbG8tNjQ1MCSDIQYxL3lcwe67AEzqnjiyBa-WpwxNLke4HoCINwA" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 8 to add, 1 to change, 8 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*